app/controllers/bands_controller.rb

SELECT "bands".* FROM "bands"
---
    def index
        # render plain: "hello"
        render json: Band.all

INSERT INTO "bands" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Queen"], ["created_at", "2019-01-31 23:22:16.701874"], ["updated_at", "2019-01-31 23:22:16.701874"]]
---
    def create
        # debugger
        band = Band.new(band_params)
        if band
            band.save